{
  "users": [
    {
      "id": 1,
      "name": "Burak",
      "surname": "Özel",
      "email": "burak@ozel.com",
      "password": "12345678",
      "userRole": "admin"
    },
    {
      "id": 2,
      "name": "Burak",
      "surname": "Özel",
      "email": "admin@etiya.com",
      "password": "admin123",
      "userRole": "admin"
    },
    {
      "name": "Burak",
      "surname": "ÖZEL",
      "email": "b.ozel@gmail.com",
      "password": "12121212",
      "userRole": "user",
      "id": 3
    },
    {
      "name": "Ali",
      "surname": "Toplu",
      "email": "alitoplu@gmail.com",
      "password": "12312312",
      "userRole": "user",
      "id": 4
    },
    {
      "name": "Furkan",
      "surname": "Akpolat",
      "email": "furkan@gmail.com",
      "password": "12121212",
      "userRole": "user",
      "id": 5
    },
    {
      "name": "Yiğit",
      "surname": "Sargın",
      "email": "yigitsargin@gmail.com",
      "password": "12345678",
      "userRole": "user",
      "id": 6
    }
  ],
  "books": [
    {
      "bookName": "Sefiller",
      "author": "Victor Hugo",
      "aboutTheBook": "Yoksul bir köylü çocuğu olan Jan Valjan, küçük yaşta annesini ve babasını kaybetti. Gidecek başka yeri olmadığı için yedi çocukla dul kalan ablasının yanına gitti. Yetim kalan çocuklara babalık, ablasına da yardım etti. Aradan geçen yıllar onu içine kapalı, sessiz, ama güçlü kuvvetli bir delikanlı yapmıştı. Çektiği sıkıntıdan yakınmıyor, yalnızca ablasının ve yedi çocuğunun karnını nasıl doyuracağını düşünüyordu. Bu hiç de kolay değildi maalesef...Jan Valjan''ın elinden her iş gelirdi. Yarıcılık, orakçılık, yanaşmalık ve bağ budayıcılığı... Ama bu işler de her zaman bulunamıyor, işsiz kaldığı zamanlar da oluyordu... Jan Valjan, kışın çok soğuk geçtiği ve kıtlık olduğu o yıl da işsiz kaldı. Kendini düşünmüyordu ama evde bir lokma ekmek bekleyen aç yedi çocuk vardı. Karınlarını doyurabilmek için hiçbir çare bulamayınca sonunda bir fırından ekmek çalmak zorunda kaldı.",
      "barcodeNumber": 8569874215,
      "shelfNumber": 1,
      "category": "Roman",
      "imageId": 1,
      "id": 1
    },
    {
      "bookName": "Suç Ve Ceza",
      "author": "Fyodor Mihailoviç Dostoyevski",
      "aboutTheBook": "Yüce bir amaca hizmet eden suç, aslında suç değil midir? Bu soruyu merkeze alan Suç ve Ceza, dünyanın en önemli yazarları arasında olduğu tartışma götürmeyen Dostoyevski’nin en yetkin eserlerinden biri. Türkiye İş Bankası Kültür Yayınları bu başyapıtı Hasan Al Yücel Klasikler Dizisinin 45. kitabı olarak yeniden okurların ilgisine sunuyor. Eser alt dizi olarak da F.M. Dostoyevski – Bütün Eserleri serisinin de ilk kitabı olma özelliğini taşıyor.",
      "barcodeNumber": 6433502449,
      "shelfNumber": "2",
      "category": "Roman",
      "imageId": "2",
      "id": 2
    },
    {
      "bookName": "Savaş Ve Barış",
      "author": "Lev Nikolayeviç Tolstoy",
      "aboutTheBook": "Lev Nikolayeviç Tolstoy (1828-1910): Anna Karenina, Kreutzer Sonat ve Diriliş’in büyük yazarı Tolstoy, yaşamının son otuz yılında kendini insan, aile, din, devlet, toplum",
      "barcodeNumber": 4866416794,
      "shelfNumber": "3",
      "category": "Roman",
      "imageId": "3",
      "id": 3
    },
    {
      "bookName": "İki Dünya Arasında",
      "author": "Julia Sena Yamanoğlu",
      "aboutTheBook": "İnsan doğduğu, büyüdüğü, yaşadığı yere yabancılaşır bazen. Başka bir yerdenmiş ve hatta başka biriymiş gibi olur. En çok gitmek ister öyle zamanlarda, uzaklaşmak ve hatta belki de kaçmak ister.\nÇoğu cesaret edemez buna. Peki ya cesaret edebilsen? Karanlıktan çıksan aydınlığa? Gönlünü bir kelepçe gibi saran her şeyden kurtulsan? İnanmak denen su serpilse ateşinin üzerine?\nİşte şimdi bu kitap bize Batı’nın karanlığında uyuyup İslam’ın aydınlığına uyanan ve belki de mecburen “İki Dünya Arasında” kalmış bir kızın hissettiklerini anlatıyor. Bizim olduğumuz yerden bakıyor kendi dünyasına ve kendi doğduğu yerden bizi seyrediyor.\nİçini döküyor, dertleşiyor ve hatta ağlıyor sayfaların arasında…",
      "barcodeNumber": 9658545328,
      "shelfNumber": "4",
      "category": "Roman",
      "imageId": "4",
      "id": 4
    },
    {
      "bookName": "Simyacı",
      "author": "Paulo Coelho",
      "aboutTheBook": "1947 yılında Rio de Janeiro kentinde doğan Paulo Coelho, 1986 yılında Hac adlı ilk romanından sonra gelen Simyacı ile tüm dünyada üne kavuşuyor. 170 ülkede 80 dilde yayımlanan kitapları ile çok sayıda ödüle layık görülen yazar, Piedra Irmağı'nın Kıyısında Oturdum Ağladım, Beşinci Dağ, Veronika Ölmek İstiyor, Şeytan ve Genç Kadın, Elif, Portobello Cadısı gibi birçok eseri ile ününü devam ettiriyor. Birleşmiş Milletler Elçisi ve Brezilya Edebiyat Akademisi üyesi olan Coelho, 1988 yılında yayımlanan Simyacı kitabı ile pek çok eleştirmen tarafından 20. yüzyılın fenomeni olarak adlandırılıyor. Simyacı, Can Yayınları tarafından ilk kez 1996 yılında basılarak Türk okurlarıyla buluşuyor. Orijinal dili İspanyolca olan kitap, Özdemir İnce'nin çevirisi ile aktarılıyor.\n\nKendi hayallerine sıkı sıkıya tutunan Santiago, anne ve babası tarafından din adamı olması için papaz okuluna gönderiliyor. Ancak küçüklüğünden beri dünyayı tanımayı hayal eden Santiago, bir akşam cesaretini toplayıp babasına rahip olmak istemediğini ve dünyayı gezmek istediğini söylüyor. Babası, dünyanın bütün insanlarının köylerinden gelip geçtiğini, hepsinin köyün insanlarına benzediğini söylese de, Santiago o insanların geldikleri yerleri tanımak istediği konusunda ısrar ediyor. Baba, ertesi gün oğluna içinde üç adet İspanyol altını olan bir kese uzatarak bununla bir sürü almasını, en iyisinin kendi şatoları ve en güzel kadınların kendi kadınları olduğunu anlayana dek dünyayı dolaşmasını söylüyor. Babası tarafından kutsanan Santiago, hayalinin peşine böylece takılıyor.",
      "barcodeNumber": 2139856874,
      "shelfNumber": "5",
      "category": "Roman",
      "imageId": "5",
      "id": 5
    },
    {
      "bookName": "Masumiyet Müzesi",
      "author": "Orhan Pamuk",
      "aboutTheBook": "“Hayatımın en mutlu ânıymış, bilmiyordum.”\nNobel ödüllü büyük yazarımız Orhan Pamuk'un harikulade aşk romanı bu sözlerle başlıyor...\n1975'te bir bahar günü başlayıp günümüze kadar gelen, İstanbullu zengin çocuğu Kemal ile uzak ve yoksul akrabası Füsun'un hikâyesi: Hızı, hareketi, olaylarının ve kahramanlarının zenginliği, mizah duygusu ve insan ruhunun derinliklerindeki fırtınaları hissettirme gücüyle, Masumiyet Müzesi, elinizden bırakamayacağınız ve yeniden okuyacağınız kitaplardan biri olacak.",
      "barcodeNumber": 5429295718,
      "shelfNumber": "6",
      "category": "Roman",
      "imageId": "6",
      "id": 6
    },
    {
      "bookName": "Romeo ve Juliet",
      "author": "William Shakespeare",
      "aboutTheBook": "Oyunları ve şiirlerinde insanlık durumlarını dile getiriş gücüyle yaklaşık 400 yıldır bütün dünya okur ve seyircilerini etkilemeyi sürdüren efsanevi yazar, Romeo ve Juliet’de birbirinden farklı pek çok toplumda benzerleriyle karşılaşılan trajik bir ilişkiyi, düşman ailelerin çocukları arasında doğan aşkı ele alır. Romeo ile Juliet’in umutsuz aşkını romantik örgüsünün yarı karanlık örtüsüyle sarmalayan eser, buna rağmen insan ilişkilerini gerçekçi bir anlayışla gözler önüne serer.",
      "barcodeNumber": 3419295717,
      "shelfNumber": "7",
      "category": "Roman",
      "imageId": "7",
      "id": 7
    },
    {
      "bookName": "Kürk Mantolu Madonna",
      "author": "Sabahattin Ali",
      "aboutTheBook": "\"Her gün, daima öğleden sonra oraya gidiyor, koridorlardaki resimlere bakıyormuş gibi ağır ağır, fakat büyük bir sabırsızlıkla asıl hedefine varmak isteyen adımlarımı zorla zapt ederek geziniyor, rastgele gözüme çarpmış gibi önünde durduğum \"Kürk Mantolu Madonna\"yı seyre dalıyor, ta kapılar kapanıncaya kadar orada bekliyordum.\" Kimi tutkular rehberimiz olur yaşam boyunca. Kollarıyla bizi sarar. Sorgulamadan peşlerinden gideriz ve hiç pişman olmayacağımızı biliriz. Yapıtlarında insanların görünmeyen yüzlerini ortaya çıkaran Sabahattin Ali, bu kitabında güçlü bir tutkunun resmini çiziyor. Düzenin sildiği kişiliklere, yaşamın uçuculuğuna ve aşkın olanaksızlığına (?) dair, yanıtlanması zor sorular soruyor.",
      "barcodeNumber": 4431276519,
      "shelfNumber": "8",
      "category": "Roman",
      "imageId": "8",
      "id": 8
    },
    {
      "bookName": "Şeker Portakalı",
      "author": "Jose Mauro De Vasconcelos",
      "aboutTheBook": "“Ne güzel bir şeker portakalı fidanıymış bu! Hem bak, dikeni de yok. Pek de kişilik sahibiymiş, şeker portakalı olduğu ta uzaktan belli. Ben senin boyunda olsaydım başka şey istemezdim.”\n“Ama ben büyük bir ağaç istiyordum.”\n“İyi düşün, Zezé. Henüz gencecik bir fidan bu. Bir gün koca bir ağaca dönüşecek. Seninle beraber büyüyecek. İki kardeş gibi iyi anlaşacaksınız. Dalını gördün mü? Bir tanecik dalı olsa da sanki özellikle senin binmen için hazırlanmış bir ata benziyor.”",
      "barcodeNumber": 4057475719,
      "shelfNumber": "9",
      "category": "Çocuk",
      "imageId": "9",
      "id": 9
    },
    {
      "bookName": "Benim Zürafam Uçabilir",
      "author": "Mert Arık ",
      "aboutTheBook": "Herkes zürafa resmi çizebilir. Siz de çizebilirsiniz!\nMoni, resim derslerini çok severdi. İlginç şekiller çizmeye ve renklerle oynamaya bayılırdı. Fakat bir gün tuhaf bir şey oldu. Moni resim çizemedi.\nHem de zürafa resmini… Öğretmeni, Moni’yi hayal ettiği her zürafayı çizebileceği konusunda cesaretlendirmeye çalışsa da o ikna olmuyordu.\nAncak öğretmeninin pes etmeye niyeti yoktu. Tabii Moni’nin de… Peki Moni, zürafa resmi çizebildi mi?",
      "barcodeNumber": 5342553575,
      "shelfNumber": "10",
      "category": "Çocuk",
      "imageId": "10",
      "id": 10
    },
    {
      "bookName": "Delifişek",
      "author": "Jose Mauro De Vasconcelos ",
      "aboutTheBook": "Brezilyalı Jose Mauro de Vasconcelos'un, kendi yaşam kesitlerinden yola çıkarak yazdığı Şeker Portakalı'nı Türkiye'de yediden yetmişe herkes severek okuyor. Romanın kahramanı küçük Zeze, çocukların en yakın dostu; büyüklerin de yüreklerine yerleşmiş bir sevgili çocuk. Şeker Portakalı'nın devamı ve ikinci bölümü olan Güneşi Uyandıralım'daki Zeze biraz daha büyümüş, artık okullu olmuştur. Küçüklüğündeki sevgili dostu, dert ortağı Şeker Portakalı fidanı yoktur, ama bu kez yüreğinde sevimli Kurbağa'sı vardır. Bu dizinin üçüncü bölümü olan Delifişek'te Zeze'yi daha da büyümüş bulacaksınız. ",
      "barcodeNumber": 9407508353,
      "shelfNumber": "11",
      "category": "Çocuk",
      "imageId": "11",
      "id": 11
    },
    {
      "bookName": "Pal Sokağı Çocukları",
      "author": "Ferenc Molnar",
      "aboutTheBook": "Nemecsek, Boka ve Pál Sokağı’nın öbür çocukları 1907 yılında Budapeşte’nin yoksul Józsefváros semtinden yola çıktılar. Bugün artık bütün dünyada tanınıyorlar. Bugüne kadar her yaştan milyonlarca insan onların dokunaklı hikâyesini okudu; tıpkı Budapeşteli çocuklar gibi onlar da Boka’nın cesaretine hayran oldu, Nemecsek’in ürkek ama kararlı kahramanlığı karşısında gözyaşlarını tutamadı.Şimdi artık Pál Sokağı Çocukları’nın Arsa’sında kocaman çok katlı evler var.\nAma ne gam: Dünyanın bütün çocukları\nPál Sokağı’ndandır!\n",
      "barcodeNumber": 7416863346,
      "shelfNumber": "12",
      "category": "Çocuk",
      "imageId": "12",
      "id": 12
    },
    {
      "bookName": "Güneşi Uyandıralım",
      "author": "Jose Mauro De Vasconcelos ",
      "aboutTheBook": "Şeker Portakalı'nın sevimli, küçük kahramanı Zeze işte yine karşınızda. Gözlerinin içi yine ışıl ışıl, yüreği yine sevgi dolu. Ama hüzünleri, biraz daha büyümüş bir çocuğun hüzünleri. Küçüklüğündeki küçük Şeker Portakalı yok, ama bu kez de yüreğinde sevgili kurbağası var. Zengin ve aşırı alıngan bir aile tarafından evlat edinilmiş. Ama Zeze yeni babasının iyi niyetine karşılık vermiyor. Evdeki biricik dostu, aşçı Dadada. Bir de düşlerindeki, yeri doldurulamayan, yüreğine kadar sokulup yerleşen kurbağa ve bir filmde görerek gerçek babasının yerine koyduğu ünlü Fransız şarkıcısı Maurice Chevalier.",
      "barcodeNumber": 3175599160,
      "shelfNumber": "13",
      "category": "Çocuk",
      "imageId": "13",
      "id": 13
    },
    {
      "bookName": "Uzaya Giden Tren",
      "author": "Mert Arık",
      "aboutTheBook": "Benim Zürafam Uçabilir kitabının yazarından yine muhteşem bir macera! \nHayallerinize giden bir trene binmeye hazır mısınız?\n\nÖğretmen, bu sefer de sınıfa bir tren hikâyesi yazma görevi verdi. Bu bir ekip çalışması olacaktı. Moni ve arkadaşları sıra dışı bir tren hikâyesi yazmak için heyecan dolu bir maceraya başladı.\nBu tren Cumburlop Kasabası’na mı gidecekti yoksa Gergedanlar Köyü’ne mi?\nHayır hayır! Treni raydan çıkarma zamanı gelmişti. Çünkü bu tren uzaya gidecekti! \nPeki ama nasıl?",
      "barcodeNumber": 9179736913,
      "shelfNumber": "14",
      "category": "Çocuk",
      "imageId": "14",
      "id": 14
    },
    {
      "bookName": "101 Deyim 101 Öykü",
      "author": "Süleyman Bulut",
      "aboutTheBook": "101 DEYİM\nÖYKÜSÜNÜ BULDU!\nDeyimler nasıl ortaya\nçıkmıştı, merak ettiniz mi hiç?\nBiliyoruz ki her deyim, mutlaka bir olay sırasında, olayın kahramanlarından biri tarafından kullanıldı. Bugünkü değişmez, değiştirilemez hallerini ise yıllar içinde, kullanıla kullanıla aldı.\n \nYazarımız Süleyman Bulut,\ndeyimlerin ortaya çıkmasını\nsağlayan olayları araştırdı, derledi, topladı ve çocuklar için yeniden kaleme aldı. 101 deyimin birbirinden eğlenceli ve birbirinden ilginç\n101 öyküsü, bu kitapta!",
      "barcodeNumber": 7871488068,
      "shelfNumber": "15",
      "category": "Çocuk",
      "imageId": "15",
      "id": 15
    },
    {
      "bookName": "Zaman Bisikleti",
      "author": "Bilgin Adalı ",
      "aboutTheBook": "Zaman için dolaşabilen bir bisikletiniz olmasını istemez miydiniz? Bisikletinize atlayıp, eski çağlara kadar gidip dünyamızın ilk günlerinde yaşayan insanları yakından görmek hoşunuza gitmez miydi? Yağmur ile Damla, işte böyle bir Zaman Bisikleti icat eden iki kardeş. Değişik bir bisiklet bu. Babalarıyla birlikte sık sık bisiklete atlayıp eski çağlara gidiyorlar. Günümüzden tüm yüz bin yıl öncesine. Akdeniz'in en güzel kentlerinden biri olan Antalya'nın biraz ötesindeki 'Karain Mağarası'nın yakınında duruyorlar. Orada, bugünkü insanların ataları olan ilk insanları görüyorlar. Çuka ile Anin de bu mağarada yaşayan iki kardeş. ",
      "barcodeNumber": 9253690098,
      "shelfNumber": "16",
      "category": "Çocuk",
      "imageId": "16",
      "id": 16
    }
  ],
  "lendBooks": [
    {
      "user_email": "alitoplu@gmail.com",
      "book_barcodeNumber": 9658545328,
      "dateOfLend": "1.11.2022",
      "bookDeliveryDate": "25.11.2022",
      "id": 1
    },
    {
      "user_email": "furkan@gmail.com",
      "book_barcodeNumber": 2139856874,
      "dateOfLend": "28.11.2022",
      "bookDeliveryDate": "8.12.2022",
      "id": 2
    },
    {
      "user_email": "furkan@gmail.com",
      "book_barcodeNumber": 4057475719,
      "dateOfLend": "1.11.2022",
      "bookDeliveryDate": "24.11.2022",
      "id": 3
    },
    {
      "user_email": "yigitsargin@gmail.com",
      "book_barcodeNumber": 4431276519,
      "dateOfLend": "28.11.2022",
      "bookDeliveryDate": "20.12.2022",
      "id": 4
    },
    {
      "user_email": "yigitsargin@gmail.com",
      "book_barcodeNumber": 7871488068,
      "dateOfLend": "28.11.2022",
      "bookDeliveryDate": "10.12.2022",
      "id": 5
    },
    {
      "user_email": "yigitsargin@gmail.com",
      "book_barcodeNumber": 7416863346,
      "dateOfLend": "10.11.2022",
      "bookDeliveryDate": "10.12.2022",
      "id": 6
    },
    {
      "user_email": "b.ozel@gmail.com",
      "book_barcodeNumber": 6433502449,
      "dateOfLend": "1.11.2022",
      "bookDeliveryDate": "25.11.2022",
      "id": 7
    }
  ]
}